<a href="https://colab.research.google.com/github/kirastain/skillfactory_rds/blob/master/SkillFactory_PYTHON_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
ratings = pd.read_csv('ratings.xls')
movies = pd.read_csv('movies.xls')

In [3]:
ratings

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [4]:
movies

      movieId  ...                                       genres
0           1  ...  Adventure|Animation|Children|Comedy|Fantasy
1           2  ...                   Adventure|Children|Fantasy
2           3  ...                               Comedy|Romance
3           4  ...                         Comedy|Drama|Romance
4           5  ...                                       Comedy
...       ...  ...                                          ...
9737   193581  ...              Action|Animation|Comedy|Fantasy
9738   193583  ...                     Animation|Comedy|Fantasy
9739   193585  ...                                        Drama
9740   193587  ...                             Action|Animation
9741   193609  ...                                       Comedy

[9742 rows x 3 columns]

In [7]:
ratings.rating.max()

5.0

In [8]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

   userId  ...                                       genres
0       1  ...  Adventure|Animation|Children|Comedy|Fantasy
1       1  ...                               Comedy|Romance
2       1  ...                        Action|Crime|Thriller
3       1  ...                             Mystery|Thriller
4       1  ...                       Crime|Mystery|Thriller

[5 rows x 6 columns]

In [9]:
len(ratings) == len(joined)

True

In [11]:
ratings_check = pd.read_csv('ratings_example.txt', sep = '\t')
ratings_check.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [12]:
movies_check = pd.read_csv('movies_example.txt', sep = '\t')
movies_check.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [13]:
ratings_check.merge(movies_check, how = 'left', on = 'movieId')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [14]:
movies_check.drop_duplicates(subset = 'movieId', keep = 'first', inplace = True)
movies_check.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller

In [15]:
ratings_check.merge(movies_check, how = 'left', on = 'movieId')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

# Shop items

In [0]:
items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}

purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}

In [0]:
items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

In [22]:
data = items_df.merge(purchase_df, how='inner', on='item_id')
data

   item_id   vendor  stock_count  purchase_id  price
0   417283  Samsung           54          101  13900
1   849734       LG           33          101   5330
2   132223    Apple          122          101  38200
3   573943    Apple           18          112  49990
4    19475       LG          102          121   9890
5  3294095    Apple           43          145  33000
6   382043  Samsung           77          145  67500
7   302948  Samsung          143          145  34500
8   100132       LG           60          221  11400

In [25]:
data['perspective'] = data['stock_count'] * data.price
data[data.perspective == data.perspective.max()]

   item_id   vendor  stock_count  purchase_id  price  perspective
6   382043  Samsung           77          145  67500      5197500

In [26]:
data.perspective.sum()

19729490

In [0]:
import os
import re

In [28]:
files = os.listdir('data')
files

['ratings_8.txt',
 'ratings_4.txt',
 'ratings_9.txt',
 'ratings_1.txt',
 'ratings_6.txt',
 '.ipynb_checkpoints',
 'ratings_2.txt',
 'ratings_5.txt',
 'ratings_3.txt',
 'ratings_10.txt',
 'ratings_7.txt']

In [33]:
files1 = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']
fdata = []
for file in files1:
  if '.txt' in file:
    fdata.append(file)
fdata

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [0]:
for root, dirs, files in os.walk('data'):
    print(root, dirs, files)

In [0]:
data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])

In [37]:
for filename in files:
  if '.txt' in filename:
    temp = pd.read_csv( os.path.join('data', filename), names = ['userId', 'movieId', 'rating', 'timestamp'] )
    data = pd.concat([data, temp])
data

     userId movieId  rating   timestamp
0       483    1573     2.0  1465387568
1       483    1580     3.0  1465387435
2       483    1676     4.0  1465387586
3       483    1682     3.0  1465387384
4       483    1732     5.0  1465387406
...     ...     ...     ...         ...
9995    483    1240     5.0  1465387341
9996    483    1258     4.0  1465389633
9997    483    1259     5.0  1465387564
9998    483    1291     4.0  1465387282
9999    483    1527     3.0  1465387443

[100004 rows x 4 columns]

In [39]:
ratings[ratings.rating == 0.5].count()

userId       1370
movieId      1370
rating       1370
timestamp    1370
dtype: int64

In [42]:
joined = ratings.merge(movies, on='movieId', how='outer')
joined

        userId  ...                                       genres
0          1.0  ...  Adventure|Animation|Children|Comedy|Fantasy
1          5.0  ...  Adventure|Animation|Children|Comedy|Fantasy
2          7.0  ...  Adventure|Animation|Children|Comedy|Fantasy
3         15.0  ...  Adventure|Animation|Children|Comedy|Fantasy
4         17.0  ...  Adventure|Animation|Children|Comedy|Fantasy
...        ...  ...                                          ...
100849     NaN  ...                        Animation|Documentary
100850     NaN  ...                                       Comedy
100851     NaN  ...                        Crime|Drama|Film-Noir
100852     NaN  ...                                        Drama
100853     NaN  ...                               Comedy|Romance

[100854 rows x 6 columns]

In [43]:
movies[movies.movieId == 3456]

      movieId                                         title genres
2587     3456  Color of Paradise, The (Rang-e khoda) (1999)  Drama

In [44]:
ratings[ratings.movieId == 3456]

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []